{
  "format": "graph-model",
  "generatedBy": "2.6.0",
  "convertedBy": "TensorFlow.js Converter v3.9.0",
  "signature": {
    "inputs": {
      "rescaling_3_input": {
        "name": "rescaling_3_input:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            { "size": "-1" },
            { "size": "180" },
            { "size": "180" },
            { "size": "3" }
          ]
        }
      }
    },
    "outputs": {
      "dense_8": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "3" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/sequential_2/rescaling_3/Cast/x",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/rescaling_3/Cast_1/x",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/conv2d_6/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/conv2d_6/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/conv2d_7/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/conv2d_7/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/conv2d_8/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/conv2d_8/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/flatten_2/Const",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/dense_6/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "30976" }, { "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/dense_6/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/dense_7/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }, { "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/dense_7/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/dense_8/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }, { "size": "3" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/dense_8/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          }
        }
      },
      {
        "name": "rescaling_3_input",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "shape": {
            "shape": {
              "dim": [
                { "size": "-1" },
                { "size": "180" },
                { "size": "180" },
                { "size": "3" }
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/rescaling_3/mul",
        "op": "Mul",
        "input": [
          "rescaling_3_input",
          "StatefulPartitionedCall/sequential_2/rescaling_3/Cast/x"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/rescaling_3/add",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/sequential_2/rescaling_3/mul",
          "StatefulPartitionedCall/sequential_2/rescaling_3/Cast_1/x"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/conv2d_6/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_2/rescaling_3/add",
          "StatefulPartitionedCall/sequential_2/conv2d_6/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_2/conv2d_6/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "epsilon": { "f": 0.0 },
          "use_cudnn_on_gpu": { "b": true },
          "num_args": { "i": "1" },
          "explicit_paddings": { "list": {} },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "padding": { "s": "U0FNRQ==" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "data_format": { "s": "TkhXQw==" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/max_pooling2d_6/MaxPool",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_2/conv2d_6/Relu"],
        "attr": {
          "data_format": { "s": "TkhXQw==" },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "padding": { "s": "VkFMSUQ=" },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/conv2d_7/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_2/max_pooling2d_6/MaxPool",
          "StatefulPartitionedCall/sequential_2/conv2d_7/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_2/conv2d_7/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "explicit_paddings": { "list": {} },
          "num_args": { "i": "1" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "padding": { "s": "U0FNRQ==" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "data_format": { "s": "TkhXQw==" },
          "T": { "type": "DT_FLOAT" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "use_cudnn_on_gpu": { "b": true },
          "epsilon": { "f": 0.0 }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/max_pooling2d_7/MaxPool",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_2/conv2d_7/Relu"],
        "attr": {
          "padding": { "s": "VkFMSUQ=" },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "T": { "type": "DT_FLOAT" },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "explicit_paddings": { "list": {} },
          "data_format": { "s": "TkhXQw==" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/conv2d_8/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_2/max_pooling2d_7/MaxPool",
          "StatefulPartitionedCall/sequential_2/conv2d_8/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_2/conv2d_8/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "use_cudnn_on_gpu": { "b": true },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "explicit_paddings": { "list": {} },
          "padding": { "s": "U0FNRQ==" },
          "data_format": { "s": "TkhXQw==" },
          "epsilon": { "f": 0.0 },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/max_pooling2d_8/MaxPool",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_2/conv2d_8/Relu"],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "padding": { "s": "VkFMSUQ=" },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "data_format": { "s": "TkhXQw==" },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/flatten_2/Reshape",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/sequential_2/max_pooling2d_8/MaxPool",
          "StatefulPartitionedCall/sequential_2/flatten_2/Const"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "Tshape": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/dense_6/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential_2/flatten_2/Reshape",
          "StatefulPartitionedCall/sequential_2/dense_6/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential_2/dense_6/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "epsilon": { "f": 0.0 },
          "transpose_a": { "b": false },
          "num_args": { "i": "1" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "transpose_b": { "b": false }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/dense_7/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential_2/dense_6/Relu",
          "StatefulPartitionedCall/sequential_2/dense_7/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential_2/dense_7/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": { "b": false },
          "num_args": { "i": "1" },
          "transpose_b": { "b": false },
          "T": { "type": "DT_FLOAT" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "epsilon": { "f": 0.0 }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/dense_8/BiasAdd",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential_2/dense_7/Relu",
          "StatefulPartitionedCall/sequential_2/dense_8/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential_2/dense_8/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_b": { "b": false },
          "T": { "type": "DT_FLOAT" },
          "num_args": { "i": "1" },
          "epsilon": { "f": 0.0 },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
          "transpose_a": { "b": false }
        }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": ["StatefulPartitionedCall/sequential_2/dense_8/BiasAdd"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      }
    ],
    "library": {},
    "versions": { "producer": 808 }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of4.bin",
        "group1-shard2of4.bin",
        "group1-shard3of4.bin",
        "group1-shard4of4.bin"
      ],
      "weights": [
        {
          "name": "StatefulPartitionedCall/sequential_2/rescaling_3/Cast/x",
          "shape": [],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/rescaling_3/Cast_1/x",
          "shape": [],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/conv2d_6/Conv2D/ReadVariableOp",
          "shape": [3, 3, 3, 16],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/conv2d_6/BiasAdd/ReadVariableOp",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/conv2d_7/Conv2D/ReadVariableOp",
          "shape": [3, 3, 16, 32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/conv2d_7/BiasAdd/ReadVariableOp",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/conv2d_8/Conv2D/ReadVariableOp",
          "shape": [3, 3, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/conv2d_8/BiasAdd/ReadVariableOp",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/flatten_2/Const",
          "shape": [2],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/dense_6/MatMul/ReadVariableOp",
          "shape": [30976, 128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/dense_6/BiasAdd/ReadVariableOp",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/dense_7/MatMul/ReadVariableOp",
          "shape": [128, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/dense_7/BiasAdd/ReadVariableOp",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/dense_8/MatMul/ReadVariableOp",
          "shape": [64, 3],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/dense_8/BiasAdd/ReadVariableOp",
          "shape": [3],
          "dtype": "float32"
        }
      ]
    }
  ]
}
