{
  "format": "graph-model",
  "generatedBy": "2.6.0",
  "convertedBy": "TensorFlow.js Converter v3.9.0",
  "signature": {
    "inputs": {
      "sequential_6_input": {
        "name": "sequential_6_input:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            { "size": "-1" },
            { "size": "180" },
            { "size": "180" },
            { "size": "3" }
          ]
        }
      }
    },
    "outputs": {
      "dense_11": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "2" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/sequential_7/rescaling_9/Cast/x",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/rescaling_9/Cast_1/x",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/conv2d_15/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/conv2d_15/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/conv2d_16/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" },
                  { "size": "32" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/conv2d_16/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/conv2d_17/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/conv2d_17/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/flatten_5/Const",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/dense_10/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "30976" }, { "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/dense_10/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/dense_11/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }, { "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/dense_11/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "sequential_6_input",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "shape": {
            "shape": {
              "dim": [
                { "size": "-1" },
                { "size": "180" },
                { "size": "180" },
                { "size": "3" }
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/rescaling_9/mul",
        "op": "Mul",
        "input": [
          "sequential_6_input",
          "StatefulPartitionedCall/sequential_7/rescaling_9/Cast/x"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/rescaling_9/add",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/sequential_7/rescaling_9/mul",
          "StatefulPartitionedCall/sequential_7/rescaling_9/Cast_1/x"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/conv2d_15/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_7/rescaling_9/add",
          "StatefulPartitionedCall/sequential_7/conv2d_15/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_7/conv2d_15/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "use_cudnn_on_gpu": { "b": true },
          "data_format": { "s": "TkhXQw==" },
          "explicit_paddings": { "list": {} },
          "padding": { "s": "U0FNRQ==" },
          "T": { "type": "DT_FLOAT" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "epsilon": { "f": 0.0 },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/max_pooling2d_15/MaxPool",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_7/conv2d_15/Relu"],
        "attr": {
          "data_format": { "s": "TkhXQw==" },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "padding": { "s": "VkFMSUQ=" },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/conv2d_16/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_7/max_pooling2d_15/MaxPool",
          "StatefulPartitionedCall/sequential_7/conv2d_16/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_7/conv2d_16/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "num_args": { "i": "1" },
          "T": { "type": "DT_FLOAT" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "use_cudnn_on_gpu": { "b": true },
          "epsilon": { "f": 0.0 },
          "padding": { "s": "U0FNRQ==" },
          "explicit_paddings": { "list": {} },
          "data_format": { "s": "TkhXQw==" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/max_pooling2d_16/MaxPool",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_7/conv2d_16/Relu"],
        "attr": {
          "padding": { "s": "VkFMSUQ=" },
          "T": { "type": "DT_FLOAT" },
          "data_format": { "s": "TkhXQw==" },
          "explicit_paddings": { "list": {} },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/conv2d_17/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_7/max_pooling2d_16/MaxPool",
          "StatefulPartitionedCall/sequential_7/conv2d_17/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_7/conv2d_17/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "T": { "type": "DT_FLOAT" },
          "padding": { "s": "U0FNRQ==" },
          "data_format": { "s": "TkhXQw==" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "epsilon": { "f": 0.0 },
          "use_cudnn_on_gpu": { "b": true },
          "explicit_paddings": { "list": {} }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/max_pooling2d_17/MaxPool",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_7/conv2d_17/Relu"],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "padding": { "s": "VkFMSUQ=" },
          "explicit_paddings": { "list": {} },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "data_format": { "s": "TkhXQw==" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/flatten_5/Reshape",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/sequential_7/max_pooling2d_17/MaxPool",
          "StatefulPartitionedCall/sequential_7/flatten_5/Const"
        ],
        "attr": {
          "Tshape": { "type": "DT_INT32" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/dense_10/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential_7/flatten_5/Reshape",
          "StatefulPartitionedCall/sequential_7/dense_10/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential_7/dense_10/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_args": { "i": "1" },
          "epsilon": { "f": 0.0 },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "transpose_b": { "b": false },
          "transpose_a": { "b": false },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_7/dense_11/BiasAdd",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential_7/dense_10/Relu",
          "StatefulPartitionedCall/sequential_7/dense_11/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential_7/dense_11/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_b": { "b": false },
          "transpose_a": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" },
          "num_args": { "i": "1" }
        }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": ["StatefulPartitionedCall/sequential_7/dense_11/BiasAdd"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      }
    ],
    "library": {},
    "versions": { "producer": 808 }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of4.bin",
        "group1-shard2of4.bin",
        "group1-shard3of4.bin",
        "group1-shard4of4.bin"
      ],
      "weights": [
        {
          "name": "StatefulPartitionedCall/sequential_7/rescaling_9/Cast/x",
          "shape": [],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7/rescaling_9/Cast_1/x",
          "shape": [],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7/conv2d_15/Conv2D/ReadVariableOp",
          "shape": [3, 3, 3, 16],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7/conv2d_15/BiasAdd/ReadVariableOp",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7/conv2d_16/Conv2D/ReadVariableOp",
          "shape": [3, 3, 16, 32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7/conv2d_16/BiasAdd/ReadVariableOp",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7/conv2d_17/Conv2D/ReadVariableOp",
          "shape": [3, 3, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7/conv2d_17/BiasAdd/ReadVariableOp",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7/flatten_5/Const",
          "shape": [2],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7/dense_10/MatMul/ReadVariableOp",
          "shape": [30976, 128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7/dense_10/BiasAdd/ReadVariableOp",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7/dense_11/MatMul/ReadVariableOp",
          "shape": [128, 2],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_7/dense_11/BiasAdd/ReadVariableOp",
          "shape": [2],
          "dtype": "float32"
        }
      ]
    }
  ]
}
